; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 683888 2 2 3 8 2
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	thermograph2 - mode
	spectrograph0 - mode
	spectrograph1 - mode
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star5 - direction
	GroundStation7 - direction
	Star0 - direction
	GroundStation1 - direction
	GroundStation6 - direction
	Star8 - direction
	Phenomenon9 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 GroundStation6)
	(supports instrument1 thermograph2)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
	(supports instrument2 spectrograph0)
	(supports instrument2 thermograph2)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 GroundStation6)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon9)
)
(:goal (and
	(pointing satellite0 Star8)
	(pointing satellite1 Phenomenon9)
	(have_image Star8 spectrograph0)
	(have_image Phenomenon9 spectrograph1)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 4
2. (turn_to satellite0 star8 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star8)
   goals met: 2 of 4
3. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 2 of 4
4. (turn_to satellite1 groundstation1 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 groundstation1)
   goals met: 1 of 4
5. (calibrate satellite1 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 1 of 4
6. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 1 of 4
7. (turn_to satellite1 star8 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 star8)
   goals met: 1 of 4
8. (turn_to satellite0 groundstation6 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 groundstation6)
   goals met: 0 of 4
9. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 4
10. (take_image satellite1 star8 instrument2 spectrograph0)
   added: (have_image star8 spectrograph0)
   goals met: 1 of 4
11. (calibrate satellite0 instrument0 groundstation6)
   added: (calibrated instrument0)
   goals met: 1 of 4
12. (turn_to satellite1 phenomenon9 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 phenomenon9)
   goals met: 2 of 4
13. (turn_to satellite0 star8 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 star8)
   goals met: 3 of 4
14. (take_image satellite1 phenomenon9 instrument2 spectrograph1)
   added: (have_image phenomenon9 spectrograph1)
   goals met: 4 of 4
